1s/ERP/Conf/Documents/Лико_ОтчетФормногоУчастка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ОтчетФормногоУчастка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ЗатратыПоЗаказуДляОтгрузки</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ЗатратыПоЗаказу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыДокументовОтчетФормногоУчастка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиПоЗатратам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзготовлениеФорм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидФормы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолимера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыПолимеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНовых</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПеределок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПеределки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ПричиныПеределкиФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗасветкаStork</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСетки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Диаметр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Монтаж</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Паста</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НанесениеЭмульсии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Засветка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сварка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СнятиеДляПовторногоНанесения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МонтажБУСетки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Печатник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Stork</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сдана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТрафСетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыхСеток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтарыхСеток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСетки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыСеток</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Засветка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Паста</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НанесениеЭмульсии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смывка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыДокументовОтчетФормногоУчастка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыДокументовОтчетФормногоУчастка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Формы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗасветкиStork</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрафаретныеСетки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяЕвро</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенаПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табаш</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабашФакт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ОтчетФормногоУчастка/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.Проведен И НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ДополнительныеПраваНачальникаФормногоУчастка")) И Дата < ТекущаяДата() - 86400 Тогда
		Отказ = Истина;
		Сообщить("Нельзя вносить изменения в проведенные документы по истечении 24 часов.");
		Возврат;
	КонецЕсли;
	
	Для каждого ТЧ Из Метаданные().ТабличныеЧасти Цикл
		Для каждого Строка из ЭтотОбъект[ТЧ.Имя] Цикл
			// Если время меньше 9:30, то будем ставить вчерашнюю дату
			// 9:30 = 34200 секунд
			КолСек = Дата - НачалоДня(Дата);
			Если КолСек < 34200 Тогда
				Строка.Дата = Дата-86400;
			Иначе
				Строка.Дата = Дата;
			КонецЕсли;
			Строка.Смена = Смена;
			Строка.Сотрудник = Сотрудник;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	// Сначала удалим из заказов, связанных с этим отчетом, все связанные строки
	УдалитьИзЗаказовСвязанныеСтроки(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Теперь запишем в заказы данные из табличной части в зависимости от типа документа
	Если ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.Формы Тогда
		ИмяТЧ = "ИзготовлениеФорм";
	ИначеЕсли ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ЗасветкиStork Тогда
		ИмяТЧ = "ЗасветкаStork";
	ИначеЕсли ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ТрафаретныеСетки Тогда
		ИмяТЧ = "ТрафСетки";
	Иначе
		Сообщить("Тип документа """ + ТипДокумента + """ не предусмотрен разработчиками программы.");
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	Для каждого Строка из ЭтотОбъект[ИмяТЧ] Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Заказ) Тогда
			Сообщить("В строке № " + Строка.НомерСтроки + " не заполнен заказ. Строка пропущена");
			Продолжить;
		КонецЕсли;
		ЗаказОбъект = Строка.Заказ.ПолучитьОбъект();
		НоваяСтрока = ЗаказОбъект[ИмяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,, "НомерСтроки");
		НоваяСтрока.ОтчетФормногоУчастка = Ссылка;
		Попытка
			ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			Сообщить("Не удалось добавить строки в документ """ + Строка.Заказ + """: " + ОписаниеОшибки());
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
	
		
	КонецЦикла;
	

	НаборЗаписейЗатраты = РегистрыНакопления.Лико_ЗатратыПоЗаказу.СоздатьНаборЗаписей();
	НаборЗаписейЗатраты.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейЗатраты.Записать();
	
	НаборЗаписейЗатратыДляОтгрузки = РегистрыНакопления.Лико_ЗатратыПоЗаказуДляОтгрузки.СоздатьНаборЗаписей();
	НаборЗаписейЗатратыДляОтгрузки.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейЗатратыДляОтгрузки.Записать();
	
	
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Заказ КАК Заказ,
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка.ВидПечати КАК ВидПечати,
	|	СУММА(Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Заказ.ПлощадьКлише) КАК ПлощадьКлише,
	|	СУММА(Лико_ОтчетФормногоУчасткаИзготовлениеФорм.КоличествоНовых) КАК КоличествоШТ,
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.НомерПроката КАК НомерПроката,
	|	ВЫБОР
	|		КОГДА Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Флексо)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПолимерДляФлексоКлише)
	|		КОГДА Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Офсет)
	|			ТОГДА Лико_ОтчетФормногоУчасткаИзготовлениеФорм.РабочийЦентр.ВидРабочегоЦентра.лкЦГКлише
	|	КОНЕЦ КАК ЦеноваяГруппа,
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка.Дата КАК Дата,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Флексо)
	|				ТОГДА Лико_ОтчетФормногоУчасткаИзготовлениеФорм.КоличествоНовых * Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Заказ.ПлощадьКлише * Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение / 10000
	|			КОГДА Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Офсет)
	|				ТОГДА Лико_ОтчетФормногоУчасткаИзготовлениеФорм.КоличествоНовых
	|		КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Лико_ОтчетФормногоУчастка.ИзготовлениеФорм КАК Лико_ОтчетФормногоУчасткаИзготовлениеФорм
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
	|				,
	|				Площадка = &Площадка
	|					И Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентРаскрояПолимераФлексо)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Заказ,
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.РабочийЦентр,
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.НомерПроката,
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Флексо)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПолимерДляФлексоКлише)
	|		КОГДА Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Офсет)
	|			ТОГДА Лико_ОтчетФормногоУчасткаИзготовлениеФорм.РабочийЦентр.ВидРабочегоЦентра.лкЦГКлише
	|	КОНЕЦ,
	|	Лико_ОтчетФормногоУчасткаИзготовлениеФорм.Ссылка.ВидПечати
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ОтчетФормногоУчасткаЗасветкаStork.Заказ КАК Заказ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_ОтчетФормногоУчасткаЗасветкаStork.Засветка) КАК Количество,
	|	Лико_ОтчетФормногоУчасткаЗасветкаStork.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ОтчетФормногоУчасткаЗасветкаStork.НомерПроката КАК НомерПроката
	|ПОМЕСТИТЬ ВТТраф
	|ИЗ
	|	Документ.Лико_ОтчетФормногоУчастка.ЗасветкаStork КАК Лико_ОтчетФормногоУчасткаЗасветкаStork
	|ГДЕ
	|	Лико_ОтчетФормногоУчасткаЗасветкаStork.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ОтчетФормногоУчасткаЗасветкаStork.Заказ,
	|	Лико_ОтчетФормногоУчасткаЗасветкаStork.РабочийЦентр,
	|	Лико_ОтчетФормногоУчасткаЗасветкаStork.НомерПроката
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ОтчетФормногоУчасткаТрафСетки.Заказ,
	|	СУММА(Лико_ОтчетФормногоУчасткаТрафСетки.НовыхСеток),
	|	Лико_ОтчетФормногоУчасткаТрафСетки.РабочийЦентр,
	|	Лико_ОтчетФормногоУчасткаТрафСетки.НомерПроката
	|ИЗ
	|	Документ.Лико_ОтчетФормногоУчастка.ТрафСетки КАК Лико_ОтчетФормногоУчасткаТрафСетки
	|ГДЕ
	|	Лико_ОтчетФормногоУчасткаТрафСетки.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ОтчетФормногоУчасткаТрафСетки.Заказ,
	|	Лико_ОтчетФормногоУчасткаТрафСетки.РабочийЦентр,
	|	Лико_ОтчетФормногоУчасткаТрафСетки.НомерПроката
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Заказ КАК ЗаказКлиента,
	|	ВТ.РабочийЦентр КАК РабочийЦентр,
	|	ВТ.НомерПроката КАК НомерПроката,
	|	ВТ.Количество КАК Количество,
	|	ВТ.Количество КАК КоличествоПлан,
	|	ВТ.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследнихТабаш.Цена, ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена)) КАК СуммаПлан,
	|	ВЫБОР
	|		КОГДА ВТ.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Флексо)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КлишеФлексо)
	|		КОГДА ВТ.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Офсет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КлишеОфсет)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатьяЗатрат,
	|	ВТ.ЦеноваяГруппа КАК Затрата,
	|	ВТ.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт.Цена, 0) КАК Сумма,
	|	ВТ.КоличествоШТ КАК КоличествоШт
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
	|					И Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ВТ.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
	|					И Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО ВТ.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)
	|					И Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследнихТабаш
	|		ПО ВТ.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследнихТабаш.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)
	|					И Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт
	|		ПО ВТ.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт.ЦеноваяГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТТраф.Заказ,
	|	ВТТраф.РабочийЦентр,
	|	ВТТраф.НомерПроката,
	|	ВТТраф.Количество,
	|	ВТТраф.Количество,
	|	ВТТраф.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена),
	|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ТрафаретныеЗасветки),
	|	ВТТраф.РабочийЦентр.ВидРабочегоЦентра.лкТрафаретнаяЗасветка,
	|	ВТТраф.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт.Цена, 0),
	|	ВТТраф.Количество
	|ИЗ
	|	ВТТраф КАК ВТТраф
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
	|					И Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ВТТраф.РабочийЦентр.ВидРабочегоЦентра.лкТрафаретнаяЗасветка = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
	|					И Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО ВТТраф.РабочийЦентр.ВидРабочегоЦентра.лкТрафаретнаяЗасветка = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)
	|					И Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт
	|		ПО ВТТраф.РабочийЦентр.ВидРабочегоЦентра.лкТрафаретнаяЗасветка = Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт.ЦеноваяГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ.Заказ,
	|	ВТ.РабочийЦентр,
	|	ВТ.НомерПроката,
	|	СУММА(ВТ.Количество),
	|	ВТ.Количество,
	|	СУММА(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследнихТабаш.Цена, 0) * ВТ.Количество),
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КлишеФлексо)),
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПолотноДляФормного)),
	|	СУММА(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт.Цена, 0) * ВТ.Количество),
	|	NULL
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)
	|					И Площадка = &Площадка
	|					И ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПолотноДляФормного)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследнихТабаш
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)
	|					И Площадка = &Площадка
	|					И ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПолотноДляФормного)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВТ.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Флексо)
	|	И ВТ.Дата < ДАТАВРЕМЯ(2021, 7, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Заказ,
	|	ВТ.РабочийЦентр,
	|	ВТ.НомерПроката,
	|	ВТ.Количество";
	Запрос.УстановитьПараметр("Ссылка", ссылка);
	Запрос.УстановитьПараметр("Площадка", Организация);
	Запрос.УстановитьПараметр("ПлощадкаЛикофлекс", Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра);
	Запрос.УстановитьПараметр("Дата", КонецМесяца(Дата));


	Выборка = Запрос.Выполнить().Выбрать();
	ПОка Выборка.Следующий() Цикл
		Запись =НаборЗаписейЗатраты.Добавить();
		Запись.Регистратор = Ссылка;
		Запись.Период = Дата;
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		
		Если  ОстаткиПоЗатратам ИЛИ Дата >= '20190101000000' Тогда 
			ЗаписьОстатки =НаборЗаписейЗатратыДляОтгрузки.Добавить();
			ЗаписьОстатки.Регистратор = Ссылка;
			ЗаписьОстатки.Период = Дата;
			ЗаписьОстатки.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаполнитьЗначенияСвойств(ЗаписьОстатки, Выборка);
			ЗаписьОстатки.Сумма = Выборка.СуммаПлан;
			Если Выборка.СтатьяЗатрат = Справочники.Лико_СтатьиЗатрат.КлишеФлексо Тогда 
				ЗаписьОстатки.Количество = Выборка.КоличествоШт;
			КонецЕсли;
			
			//ЗаписьЗатратыпоЗаказуДляПродажи =НаборЗаписейЗатратыДляПродажи.Добавить();
			//ЗаполнитьЗначенияСвойств(ЗаписьЗатратыпоЗаказуДляПродажи , ЗаписьОстатки);

		КонецЕсли;	

	КонецЦикла;
	НаборЗаписейЗатраты.Записать();
  	НаборЗаписейЗатратыДляОтгрузки.Записать();
	//НаборЗаписейЗатратыДляПродажи.Записать();



	ЗафиксироватьТранзакцию();
			
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	УдалитьИзЗаказовСвязанныеСтроки(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура УдалитьИзЗаказовСвязанныеСтроки(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.ИзготовлениеФорм.ОтчетФормногоУчастка = &ОтчетФормногоУчастка";
	
	Запрос.УстановитьПараметр("ОтчетФормногоУчастка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаказОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//Для каждого ТЧ Из Метаданные().ТабличныеЧасти Цикл
			НайденныеСтроки = ЗаказОбъект.ИзготовлениеФорм.НайтиСтроки(Новый Структура("ОтчетФормногоУчастка", Ссылка));
			Для каждого Строка из НайденныеСтроки Цикл
				ЗаказОбъект.ИзготовлениеФорм.Удалить(Строка);
			КонецЦикла;
		//КонецЦикла;
		Попытка
			ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			Отказ = Истина;
			Сообщить("Не удалось удалить строки из документа """ + Выборка.Ссылка + """: " + ОписаниеОшибки());
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
